Revit 2027 API
Document.GetWorksharingCentralModelPath Method
 Gets the central model path of the worksharing model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetWorksharingCentralModelPath()
Public Function GetWorksharingCentralModelPath As ModelPath
public:
ModelPath^ GetWorksharingCentralModelPath()
member GetWorksharingCentralModelPath : unit -> ModelPath
Return Value
ModelPath
 The central model path, or null if the document is not workshared.
Exceptions
Exception | Condition
InvalidOperationException |  This Document is not a workshared document.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace